{
  "nav": {
    "0": "inicio",
    "1": "acerca",
    "2": "portafolio",
    "3": "tecnologias",
    "4": "contacto",
    "navigation-routes": {
      "0": "home",
      "1": "about",
      "2": "portfolio",
      "3": "technologies",
      "4": "contact"
    },
    "dropdown-lng": "Idioma"
  },

  "home": {
    "title": "Hola! soy Carlos, Desarrollador Full Stack",
    "description": "Soy Carlos, un recién graduado con experiencia en Desarrollo de Aplicaciones Multiplataforma (DAM) y Desarrollo de Aplicaciones Web (DAW). Mi trayectoria académica me ha proporcionado una sólida base en el desarrollo de software. Ansioso por aportar mis habilidades a proyectos dinámicos, traigo adaptabilidad y un compromiso con el aprendizaje continuo."
  },

  "about": {
    "title": "Acerca de",
    "content": "👋🏻 ¡Hola a todos! Soy Carlos, un recién graduado con enfoque en Desarrollo de Aplicaciones Multiplataforma (DAM) y Desarrollo de Aplicaciones Web (DAW). Como programador junior, mis experiencias como becario me han dotado de habilidades prácticas en el desarrollo de software. Me involucro con diversas tecnologías e lenguajes, explorando Java, PHP, JavaScript, HTML, CSS, SQL y Git, junto con frameworks como Spring Boot, Tailwind, Angular y React. También indago en tecnologías emergentes como Flutter, Kotlin Jetpack Compose y Python.",
    "content2": "🧪 Mi enfoque se centra en crear soluciones de alta calidad para impulsar el éxito del proyecto. Me mantengo actualizado sobre las tendencias tecnológicas, comprometido con el aprendizaje continuo para mejorar mis habilidades. Reconocido por la adaptabilidad, el trabajo en equipo y la resolución eficiente de problemas, adopto nuevas tecnologías con una mentalidad proactiva. Abierto a oportunidades de crecimiento profesional y ansioso por contribuir a proyectos emocionantes."
  },

  "portfolio": {
    "title": "Portafolio",
    "content": "Aquí tienes algunos de mis proyectos",
    "projects": {
      "urlShort": {
        "title": "Url Short",
        "explanation": "Short URL Backend ofrece servicios para acortar enlaces y generar códigos QR asociados. Utiliza Java 11 y Spring Boot, con configuraciones de clave secreta y algoritmo. Puedes contribuir al proyecto bajo la Licencia MIT.",
        "demoLink": "https://csn-s-url.netlify.app",
        "gitBackendRepository": "https://github.com/hgcsasdas/short-url-backend",
        "gitFrontendRepository": "https://github.com/hgcsasdas/short-url-front",
        "technologies": {
          "angular": "Angular",
          "springBoot": "Spring Boot",
          "supabase": "Supabase"
        }
      },
      "virtualAssistantPepe": {
        "title": "Asistente Virtual PEPE",
        "explanation": "Assitente virtual para la gestión de tareas con diversas funcionalidades como mandar mensajes buscar en google o hacer ersúmenes.",
        "gitBackendRepository": "https://github.com/hgcsasdas/AVPEPE",
        "technologies": {
          "python": "Python"
        }
      },
      "secondHandMarketSpring": {
        "title": "Second Hand Market Spring",
        "explanation": "Aplicación final del curso de SpringBoot 5",
        "gitBackendRepository": "https://github.com/hgcsasdas/Spring_boot_course",
        "technologies": {
          "springBoot": "Spring Boot"
        }
      }
    }
  },

  "technologies": {
    "title": "Tecnologias",
    "content": "Tecnologias que utilizo"
  },

  "contact": {
    "title": "Contacto",
    "content": "Si te gustaría que nos pusiésemos en contacto rellena el formulario :)",
    "formPlaceholderName": "Ingresa tu nombre",
    "formPlaceholderEmail": "Ingresa tu correo electrónico",
    "formPlaceholderMessage": "Ingresa tu mensaje",
    "submitButton": "Hablemos"
  },

  "footer": {
    "email": "Correo electrónico: hgc.csn@gmail.com",
    "phone": "Teléfono: 🇪🇸 +34 643 545 314"
  }
}
